#+property: header-args:R :session *beo* :output-dir (concat default-directory "")



*** Elastic net: results

#+name: en-best-fit
#+begin_src R :colnames yes :exports results
  en.model$bestTune
#+end_src

#+RESULTS: en-best-fit
| alpha | lambda |
|-------+--------|
|   0.9 |   0.07 |


#+name: en-coef
#+begin_src R :rownames yes :exports results
  round(as.matrix(coef(en.model$finalModel, s = en.model$finalModel$lambdaOpt)), 2)
#+end_src

#+latex: {\footnotesize

#+RESULTS: en-coef
| (Intercept) | -0.02 |
| DiagMC      |  0.11 |
| DiagCC      |     0 |
| DiagSC      |     0 |
| AuxVRoot    |     0 |
| AuxVSC      |     0 |
| DiagVP      |     0 |
| VtoC        |  0.12 |
| SCan        |     0 |
| ScrSC       |     0 |
| NGenSbj     |     0 |
| NGenObj     |  0.41 |
| Rel         |  0.16 |
| TopPPSpro   |  0.09 |
| TopObjSpro  |     0 |
| TopPPSbj    |     0 |
| TopObjSbj   |     0 |
| NegCon      |     0 |
| Expl        |     0 |

#+latex: }

*** Elastic net: results

#+name: en-preds
#+begin_src R :colnames yes :exports results
  res <- data.frame(text = test.texts,
             predicted = round(predict(en.model, data.test %>% select_("DiagMC", "DiagCC", "DiagSC",
                                                                 "AuxVRoot", "AuxVSC", "DiagVP",
                                                                 "VtoC", "SCan", "ScrSC", "NGenSbj",
                                                                 "NGenObj", "Rel", "TopPPSpro",
                                                                 "TopObjSpro", "TopPPSbj", "TopObjSbj",
                                                                 "NegCon", "Expl")) * sd(data.train$EstYear) +
                               mean(data.train$EstYear), 0),
             actual = data[data$Text %in% test.texts,"EstYear"])
  res$error <- res$predicted - res$actual
  res
#+end_src

#+RESULTS: en-preds
| text                               | predicted | actual | error |
|------------------------------------+-----------+--------+-------|
| 1.07 Orosius                       |       939 |    899 |    40 |
| 1.06 Augustine Soliloquy           |       961 |    898 |    63 |
| 2.01 Benedictine Rule              |       956 |    965 |    -9 |
| 3.04 Aelfric Supplemental Homilies |       994 |   1000 |    -6 |
| 3.09 Wulfstan Institutes of Polity |      1016 |   1008 |     8 |
| 3.13 Byrhtferth Manual             |       983 |   1011 |   -28 |

#+name: en-rmse
#+begin_src R
  sqrt(mean(res$error^2))
#+end_src

#+RESULTS: en-rmse
: 33


*** Results

#+name: stan-preds
#+begin_src R :colnames yes :exports results
  res <- data.frame(text = test.texts,
                    predicted = round(summary(fit, pars = "unknown_years")$summary[,"50%"] * sd(years.raw) + mean(years.raw), 0),
                    ci = str_c(round(summary(fit, pars = "unknown_years")$summary[,"2.5%"] * sd(years.raw) + mean(years.raw), 0),
                               "-",
                               round(summary(fit, pars = "unknown_years")$summary[,"97.5%"] * sd(years.raw) + mean(years.raw), 0)),
             actual = data[data$Text %in% test.texts,"EstYear"])
  res$error <- res$predicted - res$actual
  res
#+end_src

#+RESULTS: stan-preds
| text                               | predicted |        ci | actual | error |
|------------------------------------+-----------+-----------+--------+-------|
| 1.07 Orosius                       |       906 |   894-918 |    899 |     7 |
| 1.06 Augustine Soliloquy           |       914 |   906-922 |    898 |    16 |
| 2.01 Benedictine Rule              |       932 |   922-943 |    965 |   -33 |
| 3.04 Aelfric Supplemental Homilies |      1019 | 1012-1026 |   1000 |    19 |
| 3.09 Wulfstan Institutes of Polity |      1046 | 1019-1075 |   1008 |    38 |
| 3.13 Byrhtferth Manual             |       971 |   952-992 |   1011 |   -40 |

- The results are good (ever so slightly better than the elastic net model)
- But the uncertainty is not well-quantified
  - Only 1/6 texts has the actual date within the 95% CI

